app/views/tasks/index.html.erb

<ul id="task-list">
  <%= render current_user.tasks.order(created_at: :desc) %>
---
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = $1  ORDER BY "tasks"."created_at" DESC  [["user_id", 1]]