app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task = current_user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "h"], ["created_at", "2014-10-29 02:26:26.736458"], ["updated_at", "2014-10-29 02:26:26.736458"], ["user_id", 1]]

    task = Task.find(params[:id])
    task.delete
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "tasks" WHERE "tasks"."id" = 7